fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>InformationRegister.ВКМ_ПланОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = Параметры.АдресВХранилище;
	Если  ЗначениеЗаполнено(Адрес) Тогда
		
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	
	Если ОтпускаСотрудников <> Неопределено Тогда
			
	Для Каждого Строка Из ОтпускаСотрудников Цикл
	Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
	Точка.Текст = Строка.Сотрудник.Наименование;
	Серия = Диаграмма.УстановитьСерию("Отпуск");
	Серия.Текст = "Отпуск";
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);

	
	Интервал = Значение.Добавить();
	Интервал.Начало = Строка.ДатаНачала;
	Интервал.Конец = Строка.ДатаОкончания;
	
	СтрокаТаблицы = Объект.ОтпускаСотрудников.Добавить();
	ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Строка);
	
	КонецЦикла;
	КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
